function dydt = mySystem(t, y, F)
    % 参数调整
    P = 0.78 - 0.22 * F; % 与环境因素相关的参数
    r = (P - 0.56) / (0.78 - 0.56); % 与环境因素相关的参数
    b_low = 0.2; % 生长率的下限
    b_high = 0.6; % 生长率的上限
    b = b_low + r * (b_high - b_low); % 生长率
    d = 0.0002 * y(3) + 0.0003 * y(1) + 0.004 * y(4) + 0.03 * F + 0.01; % 降低死亡率的基线值

    % 微分方程调整
    dydt = zeros(5,1); % 5 个方程
    dydt(1) = y(1) * (b - d) * (1 - y(1) / 500) - 0.001 * y(3) - 0.001 * y(4) - 0.0005 * y(5); % 调整N的承载能力和相互作用系数
    dydt(2) = b * (1 - y(2) / 150) * y(2) - 0.005 * y(1) / 500; % 调整C的承载能力
    dydt(3) = (0.004 * y(1) - 0.008) * y(3); % 调整Pre的生长率和死亡率
    dydt(4) = (0.003 * y(1) - 0.008) * y(4); % 调整Par的生长率和死亡率
    dydt(5) = 0.008 * y(5) * (1 - y(5) / 200) - 0.004 * y(1) * y(5); % 调整AP的参数
end
